[
    {
        "role":"PRINCIPAL SOFTWARE ENGINEER",
        "location" : "Toronto ON, Canada",
        "company":"REDWOLF SECURITY",
        "summary":"#### A next-generation platform trusted by hundreds of Fortune 2000 companies to: \n* Validate Defence Performance\n* Improve Alerting and Detection of Events\n* Calibrate Mitigation Systems\n* Optimize Operational Responses\n* Confirm SLAs and Controls.\n\n##### Improve clients’ Cyber Defences by:\n* Designing systems and services to simulate threats\n* Monitoring customer sites for security and performance concerns\n* Recommending improvements to management\n##### Design and integrate new core framework features used for:\n* Scanning\n* Monitoring\n* Reporting on customer systems\n  * Features could include:\n    * New testing capabilities\n    * New methods to extend the framework to be integrated into projects\n    * Expanding the capability to discover to report new issues and events.\n* Create systems and services in the form of virtual machines and docker containers that generate attack traffic with the goal of reporting on what has been discovered.",
        "range":"2019 - Present"
    },
    {
        "role":"SENIOR APPLICATIONS SOFTWARE ENGINEER",
        "location" : "Fort Lauderdale FL, USA",
        "company":"AKAMAI TECHNOLOGIES INC.",
        "summary":"#### A global content delivery network, cybersecurity, and cloud service company\n* Providing web and internet security services for some of the world’s largest corporations (Amazon, Microsoft, Facebook, Apple, etc.).\nOn dozens of projects served as :\n* Project Manager\n* Lead software engineer and/or team member\n #### Adhered to high-quality development standards while delivering technology solutions on-time and on-budget\n\n#### Employed cutting-edge technologies to collaborate on the following projects:   \n##### HTTP Anomaly Detection\n* Statistically analyzed web traffic patterns to find patterns in data that do not conform to expected behavior to identify malicious actors.         \n##### Real Browser Verification\n* Designed a system to analyze network traffic to determine if a client was using a real web browser and to block the client if it did not pass the JavaScript validation.        \n##### Cluster Commander\n* Maintained a system to manage customers and their configurations on the network.        \n##### Statistical Graphing System\n* Generated graphs to identify issues on the network, anticipate attacks, and start investigations when appropriate.        \n##### Customer Portals\n* Enabled customers to view their network, services, contact information, etc.         \n##### Namespace / Network Object Mapping and Keyspace Validation\n* Created standardized objects to describe all points of data collected to enable the development of data structures.        \n##### FBM - Flow Based Monitoring\n* Statistically analyzed the traffic flowing through enterprise systems to detect malicious patterns. \n##### Talaria - Dynamic Scrubbing Center Routing \n* Designed systems to redirect traffic flow to other data centers for scrubbing to mitigate malicious traffic.",
        "range":"2007 - 2019"
    },
    {
        "role":"SENIOR SOLUTIONS SPECIALIST",
        "location" : "Windsor ON, Canada",
        "company":"DATAREALM INC.",
        "summary":"#### A solution provider to manufacturers in North America. Solves a wide range of complex client issues including controls engineering, automation of information systems, and software development. \n* Devised and integrated solutions to resolve production problems, resulting in increased efficiency and productivity, working independently and collaboratively with team of 12. \n* Successfully trained clients and employees and implemented software solutions at the terminus of several projects. \n* Developed and implemented a real-time production system solution for Ford Motor Company to replace a VAX based system known as MMS for 700+ machines. \n* Integrated a plant-wide factory visualization and monitoring system. \n* Promoted lean manufacturing methodologies and increased efficiency by creating applications that allow OPC servers to communicate with a PLC and read values, storing automated manufacturing processes. \n* Assisted in modernizing antiquated VAX based processes known as POSMON and MMS by developing conversion tools for each system to extract essential information to automatically configure the replacement system. \n* Provided extensive support on a project to monitor tool life called TOOLMON. \n* Provided interface API for Flow International, a DLL that acts as an OPC client to a PLC and feeds information to control water-jet-based CNC machines. \n* Created a web-based reporting package for Activplant using XML transformation to produce the reports. ",
        "range":"2004 - 2007"
    }
]
